Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Таблица в дерево: если зайти в мастер обработчика и произвести настройки, но не использовать поле, которому в порту было выставлено «Назначение», то значение «Используемое» у поля скидывалась в «Не задано».
en: Table to tree: When the handler wizard was used for the configuration purposes but the field marked as "Usage type" in the port was not used, "Used" field value was reset to "Unspecified".

source: Таблица в дерево: В выходном порту узла Таблица в дерево отсутствовали некоторые узлы при наличии вложенных массивов.
en: Table to tree: There were no several nodes in the output port of Table to tree node in the presence of nested arrays.

source: Таблица в дерево: если не получилось автоматически сопоставить входные и выходные поля, то после настройки узла возникала ошибка «Таблица в дерево: Выходному узлу ... не сопоставлен входной узел» и для исправления ошибки требовалось зайти в настройку выходного порта.
en: Table to tree: if the automatic mapping of the input and output fields failed, the following error occurred upon the node configuration: "Table to tree: The output node ... has not been mapped to the input node". It was required to go to the output port settings to perform the fixes.

source: Таблица в переменные: если зайти в мастер обработчика «Таблица в переменные» и произвести настройки, но не использовать поле, которому в порту было выставлено «Назначение», то значение «Используемое» у поля скидывалась в «Не задано».
en: Table to variables: When the "Table to variables" handler wizard was used for the configuration purposes but the field marked as "Usage type" in the port was not used, "Used" field value was reset to "Unspecified".

source: Таблица: в окне настройки фильтра в визуализаторе Таблица для полей типа Дата/Время при выборе условий первый / не первый или последний / не последний не определялось и не сохранялось значение параметра Базовая дата интервала (#8648).
en: Table: the value of Base interval date parameter was not defined and saved in the filter configuration window in the Table visualizer for the fields of the Date/Time type, when selecting first / not first or last / not last conditions (#8648).

source: Узел-ссылка: при сохранении пакета, содержащего Узел-ссылку, могла возникать ошибка «Узел "..." заблокирован», если в параллельной сессии выполнялся узел, использующий данные выходного порта исходного узла, на который был настроен Узел-ссылка (#8680).
en: Reference node: when saving the package containing the Reference Node, the following error could occur: "..." node is locked" if the node that used the data of the output port of the source node for which the Reference Node had been configured was executed in the parallel session (#8680).

source: Условие: В мастере настройки кнопки Переместить вверх и Переместить вниз были доступны при отсутствии портов (если сразу после добавления узла в область построения сценария открыть мастер настройки).
en: Condition: Move up and Move down buttons were available in the wizard in the absence of ports (if the wizard was opened just after adding the node to the workflow construction area).

source: Условие: при попытке выполнения узлов Объединение или Соединение, подключенных к неактивному порту Условия, возникала ошибка «Нет ни одного активного входа».
en: Condition: while attempting to execute the Union or Join nodes connected to the inactive Condition port, the following error occurred: "No active inputs".

source: Условие: На страницах мастера "Настройка списка условий" и "Настройка портов узла" изменены заголовки.
en: Condition: Headers on "Configure condition list" and "Configure node ports" wizard pages were changed.

source: Файловое хранилище: В Loginom под Linux при копировании файла из одной папки в другую время модификации файла изменялось на фактическое время.
en: File storage: When copying the file from one folder to another one in Loginom for Linux, file modification time was changed to the actual time.

source: Файловое хранилище: При огромном количестве файлов (~ 1000000) в одной из вложенных папок пользователей наблюдалась очень долгая загрузка страницы "Начало".
en: File storage: In case of a large number of files (~ 1000000) in one of the nested user folders, "Start" page was loading too long.

source: Файловое хранилище: При открытии пакета из папки с правами только на чтение возникала ошибка и пакет не открывался.
en: File storage: When opening the package from the read-only folder, an error occurred, and the package could not be opened.

source: Файловое хранилище: если новые каталоги стали доступны пользователю во время его текущей сессии, то при попытки перейти в такой каталог, пользователь получал ошибку "Cannot read property 'expandAsync' of undefined".
en: File storage: if the new directories became available to a user during his current session, while attempting to go to such directory, the following error occurred: "Cannot read property 'expandAsync' of undefined".

source: Файловое хранилище: если после открытия окна файлового хранилища менялся текущий пользователь Loginom (Главное меню → Выход, затем повторный вход под именем другого пользователя), то переставал работать механизм копирования и встравки файлов в Файловом хранилище (#6137).
en: File storage: if the current Loginom user was changed when the file storage window was opened (Root menu → Exit, then repeated login as another user), the mechanism of copying and pasting files to the file storage didn't function (#6137).

source: Файловое хранилище: при удалении символической ссылки на папку удалялась не только ссылка, но и содержимое этой папки.
en: File storage: When deleting the symbolic reference to the folder, not only the reference but also the folder content was deleted.

source: Фильтр строк: В сценариях, созданных до версии 6.5.0, перестали работать переменные в обработчике Фильтр строк, в случаях если тип поля и переменной несовместимы (#9284).
en: Row filter: Variables in the Row filter handler became inoperable in the workflows created up to 6.5.0 version, if the field and variable types were incompatible (#9284).

source: Фильтр строк: При использовании двух последовательных узлов Фильтр строк во втором узле не обновлялся список уникальных значений, если в предыдущем фильтре были внесены изменения.
en: Row filter: When using two successive Row filter nodes, the list of unique values was not updated in the second node if changes were introduced into the preceding filter.

source: Фильтр строк: если для фильтрации использовались значения типа Переменный и условие «в списке / не в списке», а затем тип значений списка задавался отличным от Переменный, то могла возникать ошибка "Uncaught Error: Duplicate newKey ... for item with oldKey ..." (#4580).
en: Row filter: if the values related to the Variable type and "listed / not listed" condition were used for filtration, and type of list values was different from the Variable one, the following error could occur: "Uncaught Error: Duplicate newKey ... for item with oldKey ..." (#4580).

source: Фильтр строк: при повторном заходе в мастер фильтрации метка на плитке с фильтром по временному промежутку отображалась не полностью, если текст был длинный.
en: Row filter: when repeatedly entering the filtering wizard, the tile caption with the filter by the time lapse was not fully displayed in case of the long text.

source: Фильтр строк Исправлена ошибка "Переход запрещен a.getFullYear is not a function" при повторном переходе на страницу настройки фильтрации после изменении типа данных используемого поля с Вещественного на Дата/Время (#8912).
en: Row filter The following error was corrected: "Next move forbidden a.getFullYear is not a function" in case of the repeated move to the filtration configuration page after change of data type of the used field from Real to Date/Time (#8912).

source: Фильтр: скорректирован отображаемый текст подсказок при выставлении условий фильтрации для фильтра по временному промежутку.
en: Filter: The displayed tip text was corrected when the filtering criteria were set for the filter by the time span.

source: Фильтр: если был выбран тип условия «в списке» или «вне списка», то при наборе значения для фильтрации некорректно предлагались возможные значения: учитывался только последний символ введенной строки (#8454).
en: Filter: if "listed" or "not listed" criterion type was selected, possible values were incorrectly offerred when selecting the filtering value: only the last character of the entered string was taken into account (#8454).

source: Цикл: в мастере настройки удалена возможность выполнения следующих действий: редактирование, удаление или перемещение переменной.
en: Loop: functionality that enabled to perform the following actions was removed in the wizard: variable editing, deleting or moving.

source: Цикл: Исправлена ошибка "Строка не может быть преобразована в значение логического типа", которая возникала в цикле с групповой обработкой по уникальным значениям полей с включенным игнорированием ошибок.
en: Loop: The following error was corrected "Row cannot be transformed to the logical value". It occurred in the loop with the group processing by unique values of the fields with activated ignoring of errors.

source: Цикл: было невозможно перенастроить переменные цикла, если переменная, с которой ранее была настроена связь, была недоступна (например, переменная была удалена в предыдущем узле) (#8789).
en: Loop: it was impossible to reconfigure the loop variables if the variable from which the connection had been earlier set was inaccessible (for example, the variable had been deleted in the previous node) (#8789).

source: Цикл: в Цикле вида Групповая обработка статистика рассчитывалась по всему входному набору данных.
en: Loop: The statistics was calculated for the whole input data set in the Loop related to the Group Processing type.

source: Цикл: при активации параллельного Цикла, содержащего вложенную Подмодель и Узел-ссылку, ссылающийся на узел, находящийся внутри Подмодели, могла возникать ошибка «Узел "Цикл" заблокирован».
en: Loop: on activation of the parallel Loop containing the nested Supernode and Reference Node referring to the node located in the Supernode, the following error could occur: "Loop" node is locked".

source: Цикл неправильно определялся базовый пакет внутри параллельного Цикла, что приводило к некорректным расчётам.
en: Loop The base package inside the parallel Loop was incorrectly defined that caused incorrect calculations.

source: Экспорт в Deductor Warehouse: при настройке парметров экспорта некорректно работала настройка соответствия столбцов.
en: Export to Deductor Warehouse: when configuring the export parameters, columns mapping setting functioned incorrectly.

source: Экспорт в Excel-файл: исправлена ошибка «Не задано имя листа», которая возникала в мастере настройки экспорта в Excel-файл при использовании переменной в качестве значения параметра Имя листа, после нажатия кнопки Далее на первом шаге маcтера настройки (#10081).
en: Export to Excel file: "Sheet name not set" error was corrected. It occurred in the Export to Excel file wizard when using the variable as the value of the Sheet name parameter after clicking on Next button at the first wizard step (#10081).

source: Экспорт в Kafka: Экспорт выполнялся бесконечно при попытке отправить сообщение размером больше максимально разрешенного брокером.
en: Export to Kafka: Export was endlessly executed while attempting to send the message the size of which exceeded the maximum size allowed by the broker.

source: Экспорт в LGD-файл: В мастере настройки удалено поле Разрядность, т.к. Loginom 7 выпускается только 64-х разрядным (#10047).
en: Export to LGD file: Bitness field was deleted in the wizard because Loginom 7 is available only in 64-bit form (#10047).

source: Экспорт в LGD-файл: Если при длительном выполнении экспорта в LGD-файл останавливалось выполнение узла (нажатием на узел), то узел все равно переходил в состояние «Выполнен успешно».
en: Export to LGD file: If the node execution was stopped (by pressing the node) while exporting to LGD file for a long time, the node moved to "Successfully executed" state anyway.

source: Экспорт в Базу данных: при попытке экспорта в MSSQL 2005 возникала ошибка «Неправильный синтаксис возле конструкции ...».
en: Export to Database: while attempting to export to MSSQL 2005, the following error occurred: "Invalid syntax near construction ...".

source: Экспорт в базу данных: В мастере настройки параметры, определяемые через управляющую переменную, не изменяли своего значения при изменении управляющей переменной.
en: Export to database: The wizard parameters defined via the control variable did not change their values when changing the control variable.

source: Экспорт в базу данных, Экспорт в Tableau: В этих мастерах настройки переместить поле таблицы с помощью клавиатуры получалось только 1 раз, а последующие нажатия клавиш Ctrl+Up или Ctrl+Down не приводили к перемещению поля.
en: Export to database, Export to Tableau: It was possible to move the table field only 1 time in these wizards using the keyboard, and subsequent using of Ctrl+Up or Ctrl+Down key combination didn't enable to move the field.

source: Экспорт в текстовый файл: Многострочные значения (строковые значения, содержащие символы переноса строк) экспортировались без обрамляющих кавычек.
en: Export to text file: The multiline values (the string values that contained line breaks) were exported without framing quotation marks.

source: OLAP-куб — один из самых популярных визуализаторов.
en: OLAP cube is one of the most popular visualizers.

source: Интеграция с Kafka построена по тому же принципу, что и интеграция с базами данных.
en: Integration with Kafka is provided according to the same principle as integration with databases.

source: Квантовании Конечных классах при формировании метки для значений времени (#9735, #9734);
en: in Binning of Coarse classes when generating the caption for the time values (#9735, #9734);

source: Кубе (#9730);
en: Cube (#9730);

source: Публикация веб-сервисов для редакции Team и новая страница настройки публикации пакетов.
en: Publication of web services for the Team edition and new page of the packages publication configuration.

source: Публикация веб-сервисов — одна из самых популярных функций платформы.
en: Publication of web services is one of the most popular platform functions.

source: Разбиение на множества (отбор со смещением),
en: Partitioning (sampling with bias),

source: Сэмплинг (отбор со смещением)
en: Sampling (sampling with bias)

source: Таблица, в которой запущена фильтрация и сортировка данных.
en: Table in which data filtering and sorting were started.

source: Loginom Integrator, Пакетное выполнение: ускорен повторный запуск узла сценария при работе через Loginom Integrator или при Пакетном выполнении (#5295).
en: Loginom Integrator, Batch processing: the repeated workflow node start when using Loginom Integrator or Batch Processing became faster (#5295).

source: Заполнение пропусков, Редактирование выбросов: если Цикл с параметром «Параллельная обработка» был настроенный на узел Заполнение пропусков или Редактирование выбросов, то в процессе выполнения Цикла могла возникать ошибка «Порт "Качество данных" имеет неподдерживаемый тип» (#8331).
en: Imputation, Eliminate Outliers: if the Loop with "Parallel processing" parameter was set to the Imputation or Eliminate Outliers node, the following error could occur during the Loop execution: "Unsupported type of the "Data quality" port" (#8331).

source: Подключения к БД FireBird, Interbase: после разрыва соединения с сервером базы данных не восстанавливалось соединение при повторной активации подключения (#8615).
en: Connections to FireBird DB, Interbase: upon database server connection loss, connection was not restored on repeated connection activation (#8615).

source: BatchLauncher: Сообщение об ошибке выводится в stderr вместо stdout (#9639).
en: BatchLauncher: Error message is displayed in stderr instead of stdout (#9639).

source: Loginom Desktop, Loginom Server: если пакет содержал запущенный процесс, то сразу возникало сообщение об ошибке «В процессе работы программы возникла ошибка.
en: Loginom Desktop, Loginom Server: if the package contained the running process, the following error message appeared at once: "Error occurred while the program was running.

source: Loginom Desktop: В настольной редакции под Linux, если не выбран файл, в заголовке диалога открытия файла под GTK выводилась строка «./../../».
en: Loginom Desktop: When there was no file selected, GTK open file dialog showed "./../../" title in the desktop edition for Linux.

source: Loginom Desktop: В настольных редакциях под Linux подключен менеджер памяти TCMalloc вместо стандартного Glibc, который медленно отдает системе неиспользуемую, освобожденную программой память.
en: Loginom Desktop: TCMalloc memory manager was connected instead of the standard Glibc in the desktop editions for Linux. It slowly gave unused memory released by the program back to the system.

source: Loginom Desktop: В приложении под Linux, работающем в окружении рабочего стола KDE, используется файловый диалог KDE, а не GTK.
en: Loginom Desktop: KDE file dialog but not GTK is used in the application for Linux that works in the environment of KDE desktop.

source: Loginom Desktop: Когда Loginom Desktop запускается через командную строку с передачей имени файла пакета, через ее аргумент открывается сценарий первого модуля, т.е. аналогично тому, когда пакет запускается через меню приложения (#7090).
en: Loginom Desktop: When Loginom Desktop was started via the command line with the package file name transfer, the first module workflow was opened via its argument, namely, similar to the situation when the package was started via the application menu (#7090).

source: Loginom Desktop: При работе под Linux запоминается последняя открытая папка в файловых диалогах (#10150).
en: Loginom Desktop: The last opened folder in the file dialogs is remembered when working with Linux (#10150).

source: Loginom Desktop: Файловый диалог локализуется в зависимости от текущего местоположения пользователя.
en: Loginom Desktop: The file dialog is localised according to the current location of the user.

source: Loginom Integrator: Если у опубликованного узла менялось количество входных полей при автосинхронизации, то на странице «Веб-сервисы» такой пакет не помечался как измененный, а нажатие на кнопку «Обновить публикацию» не приводило к обновлению метаданных для Интегратора.
en: Loginom Integrator: If the input fields count was changed for the published node while automapping, such package was not marked as the changed one on "Web services" page, and pressing on "Update publication" button did not lead to update of metadata for Integrator.

source: Loginom Integrator: Из генерируемых wsdl в Интеграторе удалены лишние строки:
en: Loginom Integrator: Unnecessary rows were deleted from generated wsdl in Integrator:

source: Loginom Integrator: Исправлена ошибка «Не задано ни одного столбца для логирования», которая возникала при запуске Интегратора, если в конфигурационном файле Интегратора, было включено логирование в базу данных и заданы не все столбцы, например, только packageNameColumn и nodeNameColumn.
en: Loginom Integrator: The following error was corrected: "No column was specified for log-in". It occurred when starting Integrator if logging to the database was enabled in the configuration file of Integrator, and not all columns were specified, for example, only packageNameColumn and nodeNameColumn.

source: Loginom Integrator: Если опубликовать пакет, открыть страницу Swagger UI Интегратора с использованием имени хоста или localhost, а затем открыть страницу Swagger UI Интегратора с использованием ip-адреса, то на странице Swagger UI выводилась ошибка "Fetch error Internal Server Error /lgi/openapi/PackageName.json".
en: Loginom Integrator: If the package was published, Integrator Swagger UI page was opened using the host name or localhost, and then Integrator Swagger UI page was opened using ip address, the following error was displayed on Swagger UI page: "Fetch error Internal Server Error /lgi/openapi/PackageName.json".

source: Loginom Integrator: Исправлена ошибка "Object reference not set to an instance of an object", которая приходила в SOAP-ответе, если через SOAP-запрос передавался пустой массив в порт Дерево данных, корневой элемент которого является массивом (#9537).
en: Loginom Integrator: The following error was corrected:"Object reference not set to an instance of an object". It was recieved in SOAP response if empty array was trasferred via SOAP request to the Data tree port the root element of which was an array (#9537).

source: Loginom Integrator: На странице /Service.svc/Rest/Help для опубликованного пакета с именем Help вместо списка конечных точек веб-сервиса отображалось сообщение "Endpoint not found".
en: Loginom Integrator: The following message was displayed instead of the list of web service endpoints on page /Service.svc/Rest/Help for the published package with Help name: "Endpoint not found".

source: Loginom Server: В Диспетчере отображался старый идентификатор сессии после ее перезапуска, т.е. идентификатор сессии и время ее создания не менялись.
en: Loginom Server: The old session identifier was displayed in the Session Manager after its restart. Namely, the identifier of the session and the date of its creation didn't change.

source: Loginom Server: При многократных последовательных запусках пакетного выполнения в Диспетчере для сессий, созданных из BatchLauncher, в колонке Активность иногда ошибочно отображалось «Удаляется» во время выполнения пакета.
en: Loginom Server: In the case of the multiple sequential starts of batch processing in the Session Manager for the sessions created from BatchLauncher, sometimes "Deleted" was incorrectly displayed in Activity column during the package execution.

source: Loginom Server: При работе под Linux для логирования ошибок старта loginomd вместо syslog используется journald.
en: Loginom Server: When working with Linux, for logging loginomd start errors instead of syslog journald is used.

source: Loginom Server: Базовый пакет (пакет, на который ссылается другой пакет), заблокированный одним пользователем (открытый с возможностью редактирования), второй пользователь первый раз мог открыть только на чтение, а вот повторное открытие уже позволяло редактировать базовый пакет.
en: Loginom Server: The base package (the package to which another package refers) locked by the user (opened with the possibility to edit) can be opened by the second user as read-only, whereas the repeated opening enabled to edit the base package.

source: Loginom Server: при использовании веб-сервера Apache с конфигурацией, создаваемой по умолчанию, не работало подключение через Web Socket Proxy.
en: Loginom Server: when using Apache web server with the configuration created by default, connection via Web Socket Proxy failed.

source: Oracle, ODBC: исправлено чтение полей таблиц с именами, содержащими буквы в нижнем регистре.
en: Oracle, ODBC: reading of table fields with names containing lowercase letters was corrected.

source: Oracle: исправлена ошибка при вызове процедуры, принимающей строковый параметр больше 4000 символов в качестве аргумента функции.
en: Oracle: The error occurred when calling the procedure that accepts the row parameter exceeding 4,000 characters as the function argument was corrected.

source: PostgreSQL: при подключении к PostgreSQL 14 через ODBC-драйвер выполнение запроса приводило к ошибке "Ошибка открытия SQL:...".
en: PostgreSQL: when connecting to PostgreSQL 14 via ODBC driver request execution caused the following error: "Error when opening SQL:...".
